validation/full/5atm300K/constant/immersedBoundaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      immersedBoundaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Minimum alpha for full cell treatment
alphaMin  alphaMin  [ 0 0 0 0 0 0 0 ] 0.05;

// Minimum alpha to use planar reconstruction algorithm on
reconstructTol  reconstructTol  [ 0 0 0 0 0 0 0 ] 5e-4;

// ************************************************************************* //
