validation/full/5atm300K/0.org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 5.05e5;

boundaryField
{
    sides
    {
        type            symmetryPlane;
    }

    top
    {
        type            fixedValue;
        value           uniform 5.05e5;
//         type            waveTransmissive;
//         value           uniform 1e5;
//         phi             phi;
//         rho             rho;
//         gamma           1.2;
//         lInf            0.00;
//         fieldInf        1e5;

        /*type            totalPressure;
        p0              uniform 5.05e5;
        U               U;
        phi             phi;
        rho             none;
        psi             psi;
        gamma           1;
        value           uniform 1e5;*/

    }

    bottom
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            symmetryPlane;
    }
}


// ************************************************************************* //
